app/controllers/posts_controller.rb

  def show
    #posts show is going to render the same information - the data concerning a single post
    #regardless of whether it is accessed via /authors/:id/posts/:id or /posts/:id
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]